[
    {
        "name": "Eggplant Parmesan - Sophie Special",
        "category": "Italian",
        "featured": false,
        "image" : "eggplant parmesan",
        "description": "Baked eggplant with bread crumbs and lots of cheese. Delicious!",
        "prepTime": "25 minutes",
        "cookTime": "35 minutes",
        "totalTime": "1 hour",
        "servings": 10,
        "highlights": [
            "Vegetarian",
            "Healthy",
            "Easy clean-up"
        ],
        "ingredients": [
            {"name": "Eggplant, peeled and thinly sliced", "num": 3},
            {"name": "Large eggs", "num": 2},
            {"name": "Italian seasoned bread crumbs", "num": 4, "unit": "cup"},
            {"name": "Spaghetti sauce", "num": 6, "unit": "cup"},
            {"name": "Mozarella cheese, shredded", "num": 2, "unit": "cup"},
            {"name": "Parmesan cheese, grated", "num": 1, "denom": 2, "unit": "cup"},
            {"name": "Dried basil", "num": 1, "denom": 2, "unit": "teaspoon"}
        ],
        "directions": [
            "Preheat oven to 350 degrees F (175 degrees C).",
            "Dip eggplant slices in egg, then in bread crumbs. Place in a single layer on a baking sheet. Bake in preheated oven for 5 minutes on each side.",
            "In a 9x13 inch baking dish spread spaghetti sauce to cover the bottom. Place a layer of eggplant slices in the sauce. Sprinkle with mozzarella and Parmesan cheeses. Repeat with remaining ingredients, ending with the cheeses. Sprinkle basil on top.",
            "Bake in preheated oven for 35 minutes, or until golden brown."
        ]
    },
    {
	"name": "Spaghetti Alla Carbonara",
	"category": "Italian",
	"featured": true,
	"image": "carbonara",
	"description": "Spaghetti with guanciale, pecorino romano and black pepper.",
	"prepTime": "10 minutes",
	"cookTime": "10 minutes",
	"totalTime": "20 minutes",
	"servings": 4,
	"highlights": [
		"THE Roman pasta dish",
		"Carb-loaded",
		"Quick Meal"
	],
	"ingredients": [{
			"name": "Guanciale, cut into sticks of 1 x ½ x ½ inch",
			"num": 3,
			"unit": "ounce"
		},
		{
			"name": "Spaghetti",
			"num": 1,
			"unit": "pound"
		},
		{
			"name": "Large eggs yolks",
			"num": 4
		},
		{
			"name": "Large egg",
			"num": 1
		},
		{
			"name": "Finely grated Pecorino Romano",
			"num": 140,
			"unit": "gram"
		},
		{
			"name": "Freshly grounded black pepper",
			"num": 2,
			"unit": "teaspoon"
		},
		{
			"name": "Seasalt"
		},
		{
			"name": "Additional Pecorino Romano and pepper to garnish"
		}
	],
	"directions": [
		"Bring a large pot of water to a rolling boil over high heat.",
		"Meanwhile, in a large deep saute pan, heat the guanciale over low heat and sizzle until golden and light crispy, about 10 minutes. Remove from the heat and transfer three-quarters of the guanciale and its luscious fat to a large bowl to cool. Set aside the remaining guanciale on a paper towel to use as garnish. Keep the pan in reserve.",
		"Once the guanciale fat has cooled to the point it won't scramble the eggs when it comes into contact with them, add the egg yolks, whole egg, Pecorino Romano, and black pepper to the bowl, beating passionately to make a thick and creamy sauce.",
		"Once the water has reached rolling boil, season with salt until it tastes like a seasoned soup. DDrop in the pasta and cook until all dente",
		"Transfer the pasta to the pan where the guanciale was cooked.",
		"Add a ladle (½ cup) of pasta cooking water to the egg mixture, 1 tablespoon at a time, and beat energetically to combine. Pour the egg mixture over the pasta. Stir passionately until the sauce thickens, adding more pasta water as needed, 1 tablespoon at a time until you reach the perfect consistency.",
		"Serve garnisheed with a scrunch of black pepper, a dusting of Pecorino Romano, and the reserved guanciale pieces sprinkled on top."
	]
    }
]


